devnews/app/controllers/artigos_controller.rb

  def index
    # Fazer uma listagem
    @artigos = Artigo.all  # Com o @ vai ficar disponivel na view
---
SELECT "artigos".* FROM "artigos"

  def show
    @artigo = Artigo.find(params[:id])
---
SELECT "artigos".* FROM "artigos" WHERE "artigos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]